app/controllers/coupons_controller.rb

    def index
        @coupons = Coupon.all
---
SELECT "coupons".* FROM "coupons"

    def show
        @coupon = Coupon.find(params[:id])
---
SELECT  "coupons".* FROM "coupons" WHERE "coupons"."id" = ? LIMIT 1  [["id", 1]]

    def create
        @coupon = Coupon.new(coupon_code: params[:coupon][:coupon_code], store: params[:coupon][:store])
        @coupon.save
---
INSERT INTO "coupons" ("coupon_code", "store", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["coupon_code", "YAYFREE"], ["store", "Hobby Lobby"], ["created_at", "2015-11-24 16:45:01.414948"], ["updated_at", "2015-11-24 16:45:01.414948"]]